grevaillot/svd_tools/headers/STM32F105xx/memorymap.h
#pragma once 

#define TIM2_BASE			(0x40000000)
#define TIM3_BASE			(0x40000400)
#define TIM4_BASE			(0x40000800)
#define TIM5_BASE			(0x40000c00)
#define TIM6_BASE			(0x40001000)
#define TIM7_BASE			(0x40001400)
#define RTC_BASE			(0x40002800)
#define WWDG_BASE			(0x40002c00)
#define IWDG_BASE			(0x40003000)
#define SPI2_BASE			(0x40003800)
#define SPI3_BASE			(0x40003c00)
#define USART2_BASE			(0x40004400)
#define USART3_BASE			(0x40004800)
#define UART4_BASE			(0x40004c00)
#define UART5_BASE			(0x40005000)
#define I2C1_BASE			(0x40005400)
#define I2C2_BASE			(0x40005800)
#define CAN1_BASE			(0x40006400)
#define CAN2_BASE			(0x40006800)
#define BKP_BASE			(0x40006c04)
#define PWR_BASE			(0x40007000)
#define DAC_BASE			(0x40007400)
#define AFIO_BASE			(0x40010000)
#define EXTI_BASE			(0x40010400)
#define GPIOA_BASE			(0x40010800)
#define GPIOB_BASE			(0x40010c00)
#define GPIOC_BASE			(0x40011000)
#define GPIOD_BASE			(0x40011400)
#define GPIOE_BASE			(0x40011800)
#define ADC1_BASE			(0x40012400)
#define ADC2_BASE			(0x40012800)
#define TIM1_BASE			(0x40012c00)
#define SPI1_BASE			(0x40013000)
#define USART1_BASE			(0x40013800)
#define DMA1_BASE			(0x40020000)
#define DMA2_BASE			(0x40020400)
#define RCC_BASE			(0x40021000)
#define FLASH_BASE			(0x40022000)
#define CRC_BASE			(0x40023000)
#define USB_OTG_GLOBAL_BASE			(0x50000000)
#define USB_OTG_HOST_BASE			(0x50000400)
#define USB_OTG_DEVICE_BASE			(0x50000800)
#define USB_OTG_PWRCLK_BASE			(0x50000e00)
#define NVIC_BASE			(0xe000e000)
#define DBG_BASE			(0xe0042000)
